## Titanic Survival Prediction

In [1]:
import numpy as np, pandas as pd, matplotlib.pyplot as plt, seaborn as sns

In [2]:
gender_submission = pd.read_csv('gender_submission.csv')
test = pd.read_csv('test.csv')
train = pd.read_csv('train.csv')

In [3]:
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [4]:
gender_submission.shape

(418, 2)

In [5]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
test.shape

(418, 11)

In [7]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
train.shape

(891, 12)

In [9]:
y_train = train['Survived']
train.drop('Survived', axis=1, inplace=True)

In [10]:
y_train.shape

(891,)

In [11]:
X_train = train
X_train.shape

(891, 11)

In [12]:
X_test = test

In [13]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [15]:
X_train.drop(['Cabin', 'Ticket'], axis=1, inplace=True)
X_test.drop(['Cabin', 'Ticket'], axis=1, inplace=True)

In [16]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [17]:
one_hot_encoded_data = pd.get_dummies(X_train, columns = ['Embarked'])

In [18]:
X_train = one_hot_encoded_data

In [19]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,1,0,0
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,0,0,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,0,0,1

In [20]:
X_train.shape

(891, 11)

In [21]:
X_train['Sex'].replace(['male', 'female'], [1, 0], inplace=True)

In [22]:
X_train.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,3,"Braund, Mr. Owen Harris",1,22.0,1,0,7.2500,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,71.2833,1,0,0
2,3,3,"Heikkinen, Miss. Laina",0,26.0,0,0,7.9250,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,53.1000,0,0,1
4,5,3,"Allen, Mr. William Henry",1,35.0,0,0,8.0500,0,0,1

In [23]:
X_train.shape

(891, 11)

In [24]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,12.2875,S

In [25]:
one_hot_encoded_data = pd.get_dummies(X_test, columns = ['Embarked'])

In [26]:
X_test = one_hot_encoded_data

In [27]:
X_test['Sex'].replace(['male', 'female'], [1, 0], inplace=True)

In [28]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,0,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,0,0,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,0,1,0
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,0,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,0,0,1

In [29]:
X_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,"Kelly, Mr. James",1,34.5,0,0,7.8292,0,1,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,7.0000,0,0,1
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,9.6875,0,1,0
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,8.6625,0,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,12.2875,0,0,1

In [30]:
X_train.drop('Name', axis=1, inplace=True)
X_test.drop('Name', axis=1, inplace=True)

In [31]:
X_train.isnull().sum()

PassengerId      0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked_C       0
Embarked_Q       0
Embarked_S       0
dtype: int64

In [32]:
X_test.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked_C      0
Embarked_Q      0
Embarked_S      0
dtype: int64

In [33]:
for col in X_train.columns:
    print(col, '  -->  ', X_train[col].isnull().values.any())

PassengerId   -->   False
Pclass   -->   False
Sex   -->   False
Age   -->   True
SibSp   -->   False
Parch   -->   False
Fare   -->   False
Embarked_C   -->   False
Embarked_Q   -->   False
Embarked_S   -->   False

In [34]:
X_train['Age'].fillna(int(X_train['Age'].mean()), inplace=True)

In [35]:
for col in X_train.columns:
    print(col, '  -->  ', X_train[col].isnull().values.any())

PassengerId   -->   False
Pclass   -->   False
Sex   -->   False
Age   -->   False
SibSp   -->   False
Parch   -->   False
Fare   -->   False
Embarked_C   -->   False
Embarked_Q   -->   False
Embarked_S   -->   False

In [36]:
X_train['Age'] = X_train['Age'].apply(pd.to_numeric, downcast='integer')

In [37]:
X_train.shape

(891, 10)

In [38]:
X_test['Age'].fillna(int(X_test['Age'].mean()), inplace=True)

In [39]:
X_test['Age'] = X_test['Age'].apply(pd.to_numeric, downcast='integer')

In [40]:
X_test['Fare'].fillna(X_test['Fare'].mean(), inplace=True)

In [41]:
X_test.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,1,34.5,0,0,7.8292,0,1,0
1,893,3,0,47.0,1,0,7.0000,0,0,1
2,894,2,1,62.0,0,0,9.6875,0,1,0
3,895,3,1,27.0,0,0,8.6625,0,0,1
4,896,3,0,22.0,1,1,12.2875,0,0,1

In [42]:
X_test.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
dtype: int64

In [43]:
X_test.shape

(418, 10)

In [44]:
X_train.shape

(891, 10)

In [51]:
y_train.shape

(891,)

## Cross Valdiation Set

In [52]:
from sklearn.datasets import make_classification
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score

In [53]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier

In [54]:
accuracyDetails = {}

In [55]:
cv = KFold(n_splits=10, random_state=1, shuffle=True)

### Random Forest's Cross validation

In [56]:
model = RandomForestClassifier(n_estimators = 40)
scores = cross_val_score(model, X_train, y_train, scoring='accuracy', cv=cv, n_jobs=-1)

In [57]:
print(scores*100)

[76.66666667 80.8988764  73.03370787 77.52808989 85.39325843 83.14606742
 85.39325843 84.26966292 87.64044944 82.02247191]

In [58]:
print("Mean Accuracy for the Model using Random Forest = {}".format(np.round(scores.mean()*100, 2)))

Mean Accuracy for the Model using Random Forest = 81.6

In [59]:
accuracyDetails['Random Forest'] = np.round(scores.mean()*100, 2)

### SVM's Cross validation

In [60]:
model = SVC()
scores = cross_val_score(model, X_train, y_train, scoring='accuracy', cv=cv, n_jobs=-1)

In [61]:
print(scores*100)

[63.33333333 61.79775281 59.5505618  65.16853933 65.16853933 62.92134831
 66.29213483 70.78651685 66.29213483 69.66292135]

In [62]:
print("Mean Accuracy for the Model using SVM = {}".format(np.round(scores.mean()*100, 2)))

Mean Accuracy for the Model using SVM = 65.1

In [63]:
accuracyDetails['SVM'] = np.round(scores.mean()*100, 2)

### KNN's Cross validation

In [64]:
model = KNeighborsClassifier(n_neighbors=7)
scores = cross_val_score(model, X_train, y_train, scoring='accuracy', cv=cv, n_jobs=-1)

In [65]:
print(scores*100)

[63.33333333 64.04494382 62.92134831 65.16853933 60.6741573  61.79775281
 59.5505618  58.42696629 66.29213483 59.5505618 ]

In [66]:
print("Mean Accuracy for the Model using KNN = {}".format(np.round(scores.mean()*100, 2)))

Mean Accuracy for the Model using KNN = 62.18

In [67]:
accuracyDetails['KNN'] = np.round(scores.mean()*100, 2)

### Logistic Regression's Cross validation

In [68]:
model = LogisticRegression(solver='liblinear')
scores = cross_val_score(model, X_train, y_train, scoring='accuracy', cv=cv, n_jobs=-1)

In [69]:
print(scores*100)

[76.66666667 80.8988764  75.28089888 74.15730337 82.02247191 79.7752809
 86.51685393 79.7752809  80.8988764  80.8988764 ]

In [70]:
print("Mean Accuracy for the Model using Logistic Regression = {}".format(np.round(scores.mean()*100, 2)))

Mean Accuracy for the Model using Logistic Regression = 79.69

In [71]:
accuracyDetails['Logistic Regression'] = np.round(scores.mean()*100, 2)

In [72]:
print(accuracyDetails)

{'Random Forest': 81.6, 'SVM': 65.1, 'KNN': 62.18, 'Logistic Regression': 79.69}

## Using Random Forest

In [50]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.svm import SVC
from sklearn.model_selection import train_test_split

In [73]:
rfMain = RandomForestClassifier(n_estimators=40)
rfMain.fit(X_train, y_train)
y_pred = rfMain.predict(X_test)

In [76]:
y_pred

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1],
      dtype=int64)

In [83]:
y_pred_df = pd.DataFrame([gender_submission['PassengerId'] ,y_pred], index=['PassengerId', 'Survived'])

In [89]:
y_pred_df = y_pred_df.T

In [90]:
y_pred_df.to_csv('My_Predictions.csv', index=False)

## Conclusion: Random Forest works best for cross validation sets so we are using Random Forest classifier for the classification